app/Controllers/Buku.php

    public function index()
    {
        $model = new BukuModel();
        $data['buku'] = $model->findAll();
---
SELECT *
FROM `buku`

    public function simpanBuku() {
        $model = new BukuModel();

        $data = [
            'judul' => $this->request->getVar('judul'),
            'pengarang' => $this->request->getVar('pengarang'),
            'tahun' => $this->request->getVar('tahun'),
        ];

        $model->save($data);
---
INSERT INTO `buku` (`judul`, `pengarang`, `tahun`) VALUES ('Nulla deserunt aut q', 'Suscipit et quia dol', '15')