app/Controllers/Login.php

    public function login()
    {
        $session = session();
        $model_admin = new AdminModel();
        $model_pengunjung = new PengunjungModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $role = $this->request->getVar('role');

        if ($role == 'admin') {
            $user = $model_admin->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'admin@mail.com'
 LIMIT 1